[
  {
    "id": "http://arxiv.org/abs/2505.00700v1",
    "updated": "2025-05-01T17:58:21Z",
    "published": "2025-05-01T17:58:21Z",
    "title": "Luminosity Function of collapsar Gamma-Ray Bursts:the Progenitor of Long\n  Gamma-Ray Bursts Is Not Singular",
    "summary": "  Gamma-ray bursts (GRBs) are powerful probes of the high-redshift universe.\nHowever, the proportion of collapsar GRBs among long GRBs and their event rate\nrelative to the star formation rate (SFR) remain contentious issues. We assume\nthat long GRBs with $z\\geq 2$ are all collapsar GRBs and construct the\nluminosity function using a high-redshift sample from the Swift satellite\nspanning 2004 to 2019. We model the luminosity function with a broken power-law\nform and consider three scenarios: no evolution, luminosity evolution, and\ndensity evolution. Our results are as follows: 1) The no-evolution model can be\nruled out. 2) The fitting results indicate that to adequately explain the\nobservations, a significant redshift evolution in either luminosity (evolution\nindex $\\delta = 1.54^{+0.21}_{-0.22}$) or density ($\\delta =\n2.09^{+0.29}_{-0.26}$) is required. This excludes the possibility that the\nevolution of long GRBs with redshift is due to contamination from non-collapsar\nGRBs. 3) The luminosity evolution model predicts that the number of collapsar\nGRBs with $z<2$ and $P \\geq 1 \\, \\text{ph} \\, \\text{cm}^{-2} \\, \\text{s}^{-1}$\nis 138.6, accounting for 82.5% of the observed long GRBs with $z<2$ and $P \\geq\n1 \\, \\text{ph} \\, \\text{cm}^{-2} \\, \\text{s}^{-1}$. The density evolution model\npredicts that the number of collapsar GRBs with $z<2$ and $P \\geq 1 \\,\n\\text{ph} \\, \\text{cm}^{-2} \\, \\text{s}^{-1}$ is 80.2, accounting for 47.7% of\nthe observation. Regardless of the model, a substantial portion of the long\nGRBs are not collapsar GRBs.\n",
    "author": [
      {
        "name": "Yan-Kun Qu"
      },
      {
        "name": "Zhong-Xiao Man"
      },
      {
        "name": "Shuang-Xi Yi"
      },
      {
        "name": "Yu-Peng Yang"
      }
    ],
    "arxiv:doi": {
      "_": "10.3847/1538-4357/ad88e7",
      "$": {
        "xmlns:arxiv": "http://arxiv.org/schemas/atom"
      }
    },
    "link": [
      {
        "$": {
          "title": "doi",
          "href": "http://dx.doi.org/10.3847/1538-4357/ad88e7",
          "rel": "related"
        }
      },
      {
        "$": {
          "href": "http://arxiv.org/abs/2505.00700v1",
          "rel": "alternate",
          "type": "text/html"
        }
      },
      {
        "$": {
          "title": "pdf",
          "href": "http://arxiv.org/pdf/2505.00700v1",
          "rel": "related",
          "type": "application/pdf"
        }
      }
    ],
    "arxiv:comment": {
      "_": "11 pages,5 figures,publiced on The Astrophysical Journal",
      "$": {
        "xmlns:arxiv": "http://arxiv.org/schemas/atom"
      }
    },
    "arxiv:journal_ref": {
      "_": "The Astrophysical Journal, December 2024, Volume 976, Issue 2,\n  id.170, 8 pp",
      "$": {
        "xmlns:arxiv": "http://arxiv.org/schemas/atom"
      }
    },
    "arxiv:primary_category": {
      "$": {
        "xmlns:arxiv": "http://arxiv.org/schemas/atom",
        "term": "astro-ph.HE",
        "scheme": "http://arxiv.org/schemas/atom"
      }
    },
    "category": {
      "$": {
        "term": "astro-ph.HE",
        "scheme": "http://arxiv.org/schemas/atom"
      }
    }
  },
  {
    "id": "http://arxiv.org/abs/2505.00692v1",
    "updated": "2025-05-01T17:54:35Z",
    "published": "2025-05-01T17:54:35Z",
    "title": "Multi-wavelength JWST observations of (3200) Phaethon show a dehydrated\n  object with an aqueously altered origin",
    "summary": "  We present JWST observations of the near-Earth asteroid (3200) Phaethon using\nthe Near-Infrared Camera (NIRCam), Near-Infrared Spectrograph (NIRSpec), and\nMid-Infrared Instrument (MIRI) to further investigate the composition of\nPhaethon's surface. Our NIRSpec data confirms that Phaethon's surface is\ndehydrated, showing no evidence of hydrated minerals in the 3-$\\mu$m region. We\nestimate an upper limit on the hydrogen content in phyllosilicates of 0.06 wt%.\nComparisons with laboratory spectra of carbonaceous chondrites suggest that\nPhaethon's surface composition is best matched by thermally metamorphosed\nsamples of the CM chondrite Murchison (heated to 1000$^{\\circ}$C), rather than\nCY meteorites as previous work suggested. We find no evidence of ongoing\nsurface evolution due to recent perihelion passages. A comparison of the\nmid-infrared spectra of Phaethon and Bennu shows distinct spectral differences\nthat are consistent with their different thermal histories. Our findings\nfurther refine our understanding of Phaethon's current surface composition and\nevolution and provide additional insights for the upcoming DESTINY+ mission.\n",
    "author": [
      {
        "name": "Cristina A. Thomas"
      },
      {
        "name": "Andrew S. Rivkin"
      },
      {
        "name": "Ian Wong"
      },
      {
        "name": "Matthew M. Knight"
      },
      {
        "name": "Sean E. Marshall"
      },
      {
        "name": "Christopher W. Haberle"
      },
      {
        "name": "Aidan Madden-Watson"
      },
      {
        "name": "Joshua P. Emery"
      },
      {
        "name": "Annika Gustafsson"
      },
      {
        "name": "Stefanie N. Milam"
      },
      {
        "name": "Heidi B. Hammel"
      },
      {
        "name": "Ellen S. Howell"
      },
      {
        "name": "Ronald J. Vervack Jr"
      }
    ],
    "arxiv:doi": {
      "_": "10.3847/PSJ/adceba",
      "$": {
        "xmlns:arxiv": "http://arxiv.org/schemas/atom"
      }
    },
    "link": [
      {
        "$": {
          "title": "doi",
          "href": "http://dx.doi.org/10.3847/PSJ/adceba",
          "rel": "related"
        }
      },
      {
        "$": {
          "href": "http://arxiv.org/abs/2505.00692v1",
          "rel": "alternate",
          "type": "text/html"
        }
      },
      {
        "$": {
          "title": "pdf",
          "href": "http://arxiv.org/pdf/2505.00692v1",
          "rel": "related",
          "type": "application/pdf"
        }
      }
    ],
    "arxiv:comment": {
      "_": "17 pages, 11 figures, accepted Planetary Science Journal",
      "$": {
        "xmlns:arxiv": "http://arxiv.org/schemas/atom"
      }
    },
    "arxiv:primary_category": {
      "$": {
        "xmlns:arxiv": "http://arxiv.org/schemas/atom",
        "term": "astro-ph.EP",
        "scheme": "http://arxiv.org/schemas/atom"
      }
    },
    "category": {
      "$": {
        "term": "astro-ph.EP",
        "scheme": "http://arxiv.org/schemas/atom"
      }
    }
  },
  {
    "id": "http://arxiv.org/abs/2505.00676v1",
    "updated": "2025-05-01T17:31:36Z",
    "published": "2025-05-01T17:31:36Z",
    "title": "Spectral-timing analysis of the kilohertz quasi-periodic oscillations\n  and constraints on the mass of the neutron star in $4U 1636-536$ using\n  AstroSat observations",
    "summary": "  Kilohertz quasi-periodic oscillations (kHz QPOs) are believed to originate\nfrom the orbital timescales of the inner accretion flow, reflecting the\ndynamics of the innermost disk regions under strong gravitational forces.\nDespite numerous radiative and geometric models proposed so far, a\ncomprehensive explanation of the observed properties of these variability\ncomponents remains elusive. This study systematically examines kHz QPOs, their\nvariability, and their connection to spectral properties in $4U 1636-536$ using\nAstroSat data. Our analysis tracks the source transition from hard to soft\nstates in the hardness-intensity diagram. Broad spectral analysis (0.7-25 keV)\nusing SXT and LAXPC data indicates a spectrum shaped by reflection from a\nthermal corona, with contributions from boundary layer emission and a soft disk\ncomponent. We find significant changes in optical depth, blackbody temperature,\nand inner disk temperature that likely drive state transitions. Power density\nspectra reveal three variability types: a low frequency QPO (LFQPOs) (~30 Hz),\nand two simultaneous kHz QPOs. The LFQPOs and the upper kHz QPOs appear more\nprominently in soft spectral states. The presence of LFQPOs and twin kHz QPOs\nin soft spectral states enable us to estimate the neutron star mass at (2.37\n$\\pm$ 0.02) $M_\\odot$ using the relativistic precession model (RPM).\nAdditionally, time-lag and root mean square (rms) analysis provide insights\ninto the size of the corona and the radiative origin of these variability\ncomponents.\n",
    "author": [
      {
        "name": "Suchismito Chattopadhyay"
      },
      {
        "name": "Soma Mandal"
      },
      {
        "name": "Ranjeev Misra"
      }
    ],
    "arxiv:comment": {
      "_": "Submitted to MNRAS",
      "$": {
        "xmlns:arxiv": "http://arxiv.org/schemas/atom"
      }
    },
    "link": [
      {
        "$": {
          "href": "http://arxiv.org/abs/2505.00676v1",
          "rel": "alternate",
          "type": "text/html"
        }
      },
      {
        "$": {
          "title": "pdf",
          "href": "http://arxiv.org/pdf/2505.00676v1",
          "rel": "related",
          "type": "application/pdf"
        }
      }
    ],
    "arxiv:primary_category": {
      "$": {
        "xmlns:arxiv": "http://arxiv.org/schemas/atom",
        "term": "astro-ph.HE",
        "scheme": "http://arxiv.org/schemas/atom"
      }
    },
    "category": {
      "$": {
        "term": "astro-ph.HE",
        "scheme": "http://arxiv.org/schemas/atom"
      }
    }
  },
  {
    "id": "http://arxiv.org/abs/2505.00659v1",
    "updated": "2025-05-01T17:01:10Z",
    "published": "2025-05-01T17:01:10Z",
    "title": "It's All ${\\tt Ok}$: Curvature in Light of BAO from DESI DR2",
    "summary": "  Recent measurements of baryon acoustic oscillations (BAO) from the Dark\nEnergy Spectroscopic Instrument (DESI) show hints of tension with data from the\ncosmic microwave background (CMB) when interpreted within the standard model of\ncosmology. In this short note we discuss the consequences of one solution to\nthis tension, a small but negative spatial curvature with $R_k = 21 H_0^{-1}$,\nwhich DESI measures at $2\\sigma$. We describe the physical role of curvature in\ncosmological distance measures tied to recombination, i.e. the CMB and BAO, and\nthe relation to neutrino mass constraints which are relaxed to $\\sum m_\\nu <\n0.10$ eV when curvature is allowed to deviate from zero. A robust detection of\nnegative curvature would have significant implications for inflationary models:\nimproved BAO measurements, particularly from future high-redshift spectroscopic\nsurveys, will be able to distinguish curvature from other solutions to the\nDESI-CMB tension like phantom dark energy at high significance.\n",
    "author": [
      {
        "name": "Shi-Fan Chen"
      },
      {
        "name": "Matias Zaldarriaga"
      }
    ],
    "arxiv:comment": {
      "_": "11 pages, 6 figures, to be submitted to JCAP",
      "$": {
        "xmlns:arxiv": "http://arxiv.org/schemas/atom"
      }
    },
    "link": [
      {
        "$": {
          "href": "http://arxiv.org/abs/2505.00659v1",
          "rel": "alternate",
          "type": "text/html"
        }
      },
      {
        "$": {
          "title": "pdf",
          "href": "http://arxiv.org/pdf/2505.00659v1",
          "rel": "related",
          "type": "application/pdf"
        }
      }
    ],
    "arxiv:primary_category": {
      "$": {
        "xmlns:arxiv": "http://arxiv.org/schemas/atom",
        "term": "astro-ph.CO",
        "scheme": "http://arxiv.org/schemas/atom"
      }
    },
    "category": {
      "$": {
        "term": "astro-ph.CO",
        "scheme": "http://arxiv.org/schemas/atom"
      }
    }
  },
  {
    "id": "http://arxiv.org/abs/2505.00657v1",
    "updated": "2025-05-01T16:59:36Z",
    "published": "2025-05-01T16:59:36Z",
    "title": "Joint inference for gravitational wave signals and glitches using a\n  data-informed glitch model",
    "summary": "  Gravitational wave data are often contaminated by non-Gaussian noise\ntransients, glitches, which can bias the inference of astrophysical signal\nparameters. Traditional approaches either subtract glitches in a pre-processing\nstep, or a glitch model can be included from an agnostic wavelet basis (e.g.\nBayesWave). In this work, we introduce a machine-learning-based approach to\nbuild a parameterised model of glitches. We train a normalising flow on known\nglitches from the Gravity Spy catalogue, constructing an informative prior on\nthe glitch model. By incorporating this model into the Bayesian inference\nanalysis with Bilby, we estimate glitch and signal parameters simultaneously.\nWe demonstrate the performance of our method through bias reduction, glitch\nidentification and Bayesian model selection on real glitches. Our results show\nthat this approach effectively removes glitches from the data, significantly\nimproving source parameter estimation and reducing bias.\n",
    "author": [
      {
        "name": "Ann-Kristin Malz"
      },
      {
        "name": "John Veitch"
      }
    ],
    "arxiv:comment": {
      "_": "Submitted to PRD",
      "$": {
        "xmlns:arxiv": "http://arxiv.org/schemas/atom"
      }
    },
    "link": [
      {
        "$": {
          "href": "http://arxiv.org/abs/2505.00657v1",
          "rel": "alternate",
          "type": "text/html"
        }
      },
      {
        "$": {
          "title": "pdf",
          "href": "http://arxiv.org/pdf/2505.00657v1",
          "rel": "related",
          "type": "application/pdf"
        }
      }
    ],
    "arxiv:primary_category": {
      "$": {
        "xmlns:arxiv": "http://arxiv.org/schemas/atom",
        "term": "gr-qc",
        "scheme": "http://arxiv.org/schemas/atom"
      }
    },
    "category": [
      {
        "$": {
          "term": "gr-qc",
          "scheme": "http://arxiv.org/schemas/atom"
        }
      },
      {
        "$": {
          "term": "astro-ph.HE",
          "scheme": "http://arxiv.org/schemas/atom"
        }
      },
      {
        "$": {
          "term": "astro-ph.IM",
          "scheme": "http://arxiv.org/schemas/atom"
        }
      }
    ]
  },
  {
    "id": "http://arxiv.org/abs/2505.00632v1",
    "updated": "2025-05-01T16:16:47Z",
    "published": "2025-05-01T16:16:47Z",
    "title": "Detecting Modeling Bias with Continuous Time Flow Models on Weak Lensing\n  Maps",
    "summary": "  Simulation-based inference provides a powerful framework for extracting rich\ninformation from nonlinear scales in current and upcoming cosmological surveys,\nand ensuring its robustness requires stringent validation of forward models. In\nthis work, we recast forward model validation as an out-of-distribution (OoD)\ndetection problem within the framework of machine learning (ML)-based\nsimulation-based inference (SBI). We employ probability density as the metric\nfor OoD detection, and compare various density estimation techniques,\ndemonstrating that field-level probability density estimation via continuous\ntime flow models (CTFM) significantly outperforms feature-level approaches that\ncombine scattering transform (ST) or convolutional neural networks (CNN) with\nnormalizing flows (NFs), as well as NF-based field-level estimators, as\nquantified by the area under the receiver operating characteristic curve\n(AUROC). Our analysis shows that CTFM not only excels in detecting OoD samples\nbut also provides a robust metric for model selection. Additionally, we\nverified CTFM maintains consistent efficacy across different cosmologies while\nmitigating the inductive biases inherent in NF architectures. Although our\nproof-of-concept study employs simplified forward modeling and noise settings,\nour framework establishes a promising pathway for identifying unknown\nsystematics in the cosmology datasets.\n",
    "author": [
      {
        "name": "Kangning Diao"
      },
      {
        "name": "Biwei Dai"
      },
      {
        "name": "Uros Seljak"
      }
    ],
    "arxiv:comment": {
      "_": "24 pages, 8 figures, 2 tables, comments welcome",
      "$": {
        "xmlns:arxiv": "http://arxiv.org/schemas/atom"
      }
    },
    "link": [
      {
        "$": {
          "href": "http://arxiv.org/abs/2505.00632v1",
          "rel": "alternate",
          "type": "text/html"
        }
      },
      {
        "$": {
          "title": "pdf",
          "href": "http://arxiv.org/pdf/2505.00632v1",
          "rel": "related",
          "type": "application/pdf"
        }
      }
    ],
    "arxiv:primary_category": {
      "$": {
        "xmlns:arxiv": "http://arxiv.org/schemas/atom",
        "term": "astro-ph.CO",
        "scheme": "http://arxiv.org/schemas/atom"
      }
    },
    "category": [
      {
        "$": {
          "term": "astro-ph.CO",
          "scheme": "http://arxiv.org/schemas/atom"
        }
      },
      {
        "$": {
          "term": "astro-ph.IM",
          "scheme": "http://arxiv.org/schemas/atom"
        }
      }
    ]
  },
  {
    "id": "http://arxiv.org/abs/2505.00608v1",
    "updated": "2025-05-01T15:37:28Z",
    "published": "2025-05-01T15:37:28Z",
    "title": "Turning dispersion into signal: density-split analyses of pairwise\n  velocities",
    "summary": "  Pairwise velocities of the large-scale structure encode valuable information\nabout the growth of structure. They can be observed indirectly through\nredshift-space distortions and the kinetic Sunyaev-Zeldovich effect. Whether it\nis Gaussian or non-Gaussian, pairwise velocity has a broad distribution, but\nthe cosmologically useful information lies primarily in the mean - the\nstreaming velocities; the dispersion around the mean is often treated as a\nnuisance and marginalized over. This conventional approach reduces the\nconstraining power of our observations. Here, we show that this does not have\nto be the case, provided the physics behind the dispersion is understood. We\ndemonstrate that by splitting the halo/galaxy samples according to their\ndensity environments and measuring the streaming velocities separately, the\ntotal signal-to-noise is several times greater than in conventional global\nmeasurements of the pairwise velocity distribution (PVD). This improvement\narises because the global PVD is a composite of a series of near-Gaussian\ndistributions with different means and dispersions, each determined by its\nlocal density environment. Around underdense and overdense regions, the mean\nstreaming velocities are positive and negative, respectively. By splitting the\ndata, we avoid cancellation between these opposing velocities, effectively\nturning what would be considered dispersion in the global PVD into a signal.\nOur findings indicate substantial potential for improving the analysis of PVD\nobservations using the kinetic Sunyaev-Zeldovich effect and redshift-space\ndistortions.\n",
    "author": [
      {
        "name": "Aritra Kumar Gon"
      },
      {
        "name": "Yan-Chuan Cai"
      }
    ],
    "arxiv:comment": {
      "_": "7 pages, 5 figures",
      "$": {
        "xmlns:arxiv": "http://arxiv.org/schemas/atom"
      }
    },
    "link": [
      {
        "$": {
          "href": "http://arxiv.org/abs/2505.00608v1",
          "rel": "alternate",
          "type": "text/html"
        }
      },
      {
        "$": {
          "title": "pdf",
          "href": "http://arxiv.org/pdf/2505.00608v1",
          "rel": "related",
          "type": "application/pdf"
        }
      }
    ],
    "arxiv:primary_category": {
      "$": {
        "xmlns:arxiv": "http://arxiv.org/schemas/atom",
        "term": "astro-ph.CO",
        "scheme": "http://arxiv.org/schemas/atom"
      }
    },
    "category": {
      "$": {
        "term": "astro-ph.CO",
        "scheme": "http://arxiv.org/schemas/atom"
      }
    }
  },
  {
    "id": "http://arxiv.org/abs/2505.00563v1",
    "updated": "2025-05-01T14:40:23Z",
    "published": "2025-05-01T14:40:23Z",
    "title": "Dark matter as a vector field: an action principle for the Einstein\n  cluster",
    "summary": "  We show that a vector field non-minimally coupled to gravity reproduces the\ndynamics of an Einstein cluster. Our results suggest a vectorial nature for\ndark matter.\n",
    "author": [
      {
        "name": "Pedro G. S. Fernandes"
      },
      {
        "name": "Vitor Cardoso"
      }
    ],
    "arxiv:comment": {
      "_": "3 pages",
      "$": {
        "xmlns:arxiv": "http://arxiv.org/schemas/atom"
      }
    },
    "link": [
      {
        "$": {
          "href": "http://arxiv.org/abs/2505.00563v1",
          "rel": "alternate",
          "type": "text/html"
        }
      },
      {
        "$": {
          "title": "pdf",
          "href": "http://arxiv.org/pdf/2505.00563v1",
          "rel": "related",
          "type": "application/pdf"
        }
      }
    ],
    "arxiv:primary_category": {
      "$": {
        "xmlns:arxiv": "http://arxiv.org/schemas/atom",
        "term": "gr-qc",
        "scheme": "http://arxiv.org/schemas/atom"
      }
    },
    "category": [
      {
        "$": {
          "term": "gr-qc",
          "scheme": "http://arxiv.org/schemas/atom"
        }
      },
      {
        "$": {
          "term": "astro-ph.CO",
          "scheme": "http://arxiv.org/schemas/atom"
        }
      },
      {
        "$": {
          "term": "hep-ph",
          "scheme": "http://arxiv.org/schemas/atom"
        }
      }
    ]
  },
  {
    "id": "http://arxiv.org/abs/2505.00553v1",
    "updated": "2025-05-01T14:28:50Z",
    "published": "2025-05-01T14:28:50Z",
    "title": "The Jackknife method as a new approach to validate strong lens mass\n  models",
    "summary": "  The accuracy of a mass model in the strong lensing analysis is crucial for\nunbiased predictions of physical quantities such as magnifications and time\ndelays. While the mass model is optimized by changing parameters of the mass\nmodel to match predicted positions of multiple images with observations,\npositional uncertainties of multiple images often need to be boosted to take\naccount of the complex structure of dark matter in lens objects, making the\ninterpretation of the chi-square value difficult. We introduce the Jackknife\nmethod as a new method to validate strong lens mass models, specifically\nfocusing on cluster-scale mass modeling. In this approach, we remove multiple\nimages of a source from the fitting and optimize the mass model using multiple\nimages of the remaining sources. We then calculate the multiple images of the\nremoved source and quantitatively evaluate how well they match the observed\npositions. We find that the Jackknife method performs effectively in\nsimulations using a simple model. We also demonstrate our method with mass\nmodeling of the galaxy cluster MACS J0647.7+7015. We discuss the potential of\nusing the Jackknife method to validate the error estimation of the physical\nquantities by the Markov Chain Monte Carlo.\n",
    "author": [
      {
        "name": "Shun Nishida"
      },
      {
        "name": "Masamune Oguri"
      },
      {
        "name": "Yoshinobu Fudamoto"
      },
      {
        "name": "Ayari Kitamura"
      }
    ],
    "arxiv:comment": {
      "_": "12 pages, 7 figures",
      "$": {
        "xmlns:arxiv": "http://arxiv.org/schemas/atom"
      }
    },
    "link": [
      {
        "$": {
          "href": "http://arxiv.org/abs/2505.00553v1",
          "rel": "alternate",
          "type": "text/html"
        }
      },
      {
        "$": {
          "title": "pdf",
          "href": "http://arxiv.org/pdf/2505.00553v1",
          "rel": "related",
          "type": "application/pdf"
        }
      }
    ],
    "arxiv:primary_category": {
      "$": {
        "xmlns:arxiv": "http://arxiv.org/schemas/atom",
        "term": "astro-ph.CO",
        "scheme": "http://arxiv.org/schemas/atom"
      }
    },
    "category": [
      {
        "$": {
          "term": "astro-ph.CO",
          "scheme": "http://arxiv.org/schemas/atom"
        }
      },
      {
        "$": {
          "term": "astro-ph.GA",
          "scheme": "http://arxiv.org/schemas/atom"
        }
      }
    ]
  },
  {
    "id": "http://arxiv.org/abs/2505.00539v1",
    "updated": "2025-05-01T14:05:15Z",
    "published": "2025-05-01T14:05:15Z",
    "title": "Unified QMF equation of state for neutron star matter: Static and\n  dynamic properties",
    "summary": "  We construct a set of unified equations of state based on the quark mean\nfield (QMF) model, calibrated to different values of nuclear symmetry energy\nslope at the saturation density ($L_0$), with the aim of exploring both the\nstatic properties and dynamical behavior of neutron stars (NSs), and building a\ncoherent picture of their internal structure. We assess the performance of\nthese QMF models in describing the mass-radius relation, the cooling evolution\nof isolated NSs and X-ray transients, and the instabilities (e.g., the r-mode).\nIn comparison to relativistic mean field (RMF) models formulated at the\nhadronic level, the QMF model predicts heavier nuclear clusters and larger\nWigner-Seitz cell sizes in the NS crust, while the density of the free neutron\ngas remains largely similar between the two approaches. For the cooling of\nisolated NSs, the thermal evolution is found to be insensitive to both the\nmany-body model and the symmetry energy slope in the absence of the direct Urca\n(dUrca) process. However, when rapid cooling via the dUrca process is allowed,\nin the case of large $L_0$ values (e.g., $L_0 \\gtrsim 80$ MeV) in our study,\nthe QMF model predicts a longer thermal relaxation time. Both the QMF and RMF\nmodels can reproduce cooling curves consistent with observations of X-ray\ntransients (e.g., KS 1731--260) during their crustal cooling phase, although\nstellar parameters show slight variations depending on the model and symmetry\nenergy slope. Within our unified framework, a larger $L_0$ value generally\nresults in a wider instability window, while increasing the stellar mass tends\nto suppress the instability window. We also provide simple power-law\nparameterizations that quantify the dependence of bulk and shear viscosities on\nthe symmetry energy slope for nuclear matter at saturation density.\n",
    "author": [
      {
        "name": "Zhonghao Tu"
      },
      {
        "name": "Xiangdong Sun"
      },
      {
        "name": "Shuochong Han"
      },
      {
        "name": "Zhiqiang Miao"
      },
      {
        "name": "Ang Li"
      }
    ],
    "arxiv:comment": {
      "_": "15 pages, 9 figures, 3 tables",
      "$": {
        "xmlns:arxiv": "http://arxiv.org/schemas/atom"
      }
    },
    "link": [
      {
        "$": {
          "href": "http://arxiv.org/abs/2505.00539v1",
          "rel": "alternate",
          "type": "text/html"
        }
      },
      {
        "$": {
          "title": "pdf",
          "href": "http://arxiv.org/pdf/2505.00539v1",
          "rel": "related",
          "type": "application/pdf"
        }
      }
    ],
    "arxiv:primary_category": {
      "$": {
        "xmlns:arxiv": "http://arxiv.org/schemas/atom",
        "term": "nucl-th",
        "scheme": "http://arxiv.org/schemas/atom"
      }
    },
    "category": [
      {
        "$": {
          "term": "nucl-th",
          "scheme": "http://arxiv.org/schemas/atom"
        }
      },
      {
        "$": {
          "term": "astro-ph.HE",
          "scheme": "http://arxiv.org/schemas/atom"
        }
      }
    ]
  },
  {
    "id": "http://arxiv.org/abs/2505.00498v1",
    "updated": "2025-05-01T12:57:48Z",
    "published": "2025-05-01T12:57:48Z",
    "title": "Can We Probe Spacetime Non-commutativity Through Tidal Deformability of\n  Compact Objects?",
    "summary": "  We investigate the impact of spacetime non-commutativity on the tidal\ndeformability of compact objects and explore the feasibility of detecting\nnon-commutative (NC) effects through gravitational wave (GW) observations. We\nconsidered NC modifications to spacetime geometry based on de Sitter gauge\ntheory of gravity and calculate their impact on tidal deformability. While\nseveral types of compact objects have been proposed as candidates for probing\nspacetime non-commutativity, particularly at the horizon scales, our study\nshowed analytically that, for compact objects with non-singular metric at their\nsurface (such as neutron stars and boson stars), the NC correction to their\ntidal deformability converge to a finite value at the black-hole-compactness\nlimit, eliminating infinite enhancement at the horizon scales. We then compute\nthe NC corrections for neutron stars and boson stars, considering several\ndifferent models, and analyze their imprints on the GW signals. By comparing\nthe results, we assess the scale of NC effects across different compactness\nregimes and discuss the conditions under which these NC effects can be\namplified. While our findings suggest that the leading-order NC correction\ndominates the tidal deformability of a compact object near the\nblack-hole-compactness limit, we demonstrate that neutron stars and boson stars\nare not viable candidates to constrain spacetime non-commutativity, while\nrelying on the tidal deformability through GW observations.\n",
    "author": [
      {
        "name": "Junting Peng"
      },
      {
        "name": "Yanbo Zhao"
      },
      {
        "name": "Antonino Marciano"
      }
    ],
    "arxiv:comment": {
      "_": "10 pages, 8 figures",
      "$": {
        "xmlns:arxiv": "http://arxiv.org/schemas/atom"
      }
    },
    "link": [
      {
        "$": {
          "href": "http://arxiv.org/abs/2505.00498v1",
          "rel": "alternate",
          "type": "text/html"
        }
      },
      {
        "$": {
          "title": "pdf",
          "href": "http://arxiv.org/pdf/2505.00498v1",
          "rel": "related",
          "type": "application/pdf"
        }
      }
    ],
    "arxiv:primary_category": {
      "$": {
        "xmlns:arxiv": "http://arxiv.org/schemas/atom",
        "term": "gr-qc",
        "scheme": "http://arxiv.org/schemas/atom"
      }
    },
    "category": [
      {
        "$": {
          "term": "gr-qc",
          "scheme": "http://arxiv.org/schemas/atom"
        }
      },
      {
        "$": {
          "term": "astro-ph.GA",
          "scheme": "http://arxiv.org/schemas/atom"
        }
      },
      {
        "$": {
          "term": "astro-ph.HE",
          "scheme": "http://arxiv.org/schemas/atom"
        }
      },
      {
        "$": {
          "term": "hep-th",
          "scheme": "http://arxiv.org/schemas/atom"
        }
      }
    ]
  },
  {
    "id": "http://arxiv.org/abs/2505.00435v1",
    "updated": "2025-05-01T10:17:31Z",
    "published": "2025-05-01T10:17:31Z",
    "title": "Modeling Metric Gyrosynchrotron Radio Emission From the Quiet Solar\n  Corona",
    "summary": "  The radio emission of the quiet Sun in the metric and decametric bands has\nnot been well studied historically due to limitations of existing instruments.\nIt is nominally dominated by thermal brehmsstrahlung of the solar corona, but\nmay also include significant gyrosynchrotron emission, usually assumed to be\nweak under quiet conditions. In this work, we investigate the expected\ngyrosynchrotron contribution to solar radio emission in the lowest radio\nfrequencies observable by ground instruments, for different regions of the low\nand middle corona. We approximate the coronal conditions by a synoptic\nmagnetohydrodynamic (MHD) model. The thermal emission is estimated from a\nforward model based on the simulated corona. We calculate the expected\ngyrosynchrotron emission with the Fast Gyrosynchrotron Codes framework by\nFleishman & Kuznetsov (2010). The model emissions of different coronal regions\nare compared with quiet-time observations between 20-90 MHz by the LOw\nFrequency ARray (LOFAR) radio telescope. The contribution of gyrosynchrotron\nradiation to low frequency solar radio emission may shed light on effects such\nas the hitherto unexplained brightness variation observed in decametric coronal\nhole emission, and help constrain measurements of the coronal magnetic fields.\nIt can also improve our understanding of electron populations in the middle\ncorona and their relation to the formation of the solar wind.\n",
    "author": [
      {
        "name": "Kamen Kozarev"
      },
      {
        "name": "Mohamed Nedal"
      }
    ],
    "arxiv:comment": {
      "_": "15 pages, 8 figures; Submitted to Bulgarian Astronomical Journal",
      "$": {
        "xmlns:arxiv": "http://arxiv.org/schemas/atom"
      }
    },
    "link": [
      {
        "$": {
          "href": "http://arxiv.org/abs/2505.00435v1",
          "rel": "alternate",
          "type": "text/html"
        }
      },
      {
        "$": {
          "title": "pdf",
          "href": "http://arxiv.org/pdf/2505.00435v1",
          "rel": "related",
          "type": "application/pdf"
        }
      }
    ],
    "arxiv:primary_category": {
      "$": {
        "xmlns:arxiv": "http://arxiv.org/schemas/atom",
        "term": "astro-ph.SR",
        "scheme": "http://arxiv.org/schemas/atom"
      }
    },
    "category": {
      "$": {
        "term": "astro-ph.SR",
        "scheme": "http://arxiv.org/schemas/atom"
      }
    }
  },
  {
    "id": "http://arxiv.org/abs/2505.00423v1",
    "updated": "2025-05-01T09:45:32Z",
    "published": "2025-05-01T09:45:32Z",
    "title": "Thermal evolution model from cometary nuclei to asteroids considering\n  contraction associated with ice sublimation",
    "summary": "  Comet--asteroid transition (CAT) objects are small solar system bodies in the\nprocess of evolving from cometary nuclei into asteroids, as they gradually lose\nvolatile substances due to solar heating. The volatile material is mainly water\nice, and the time required for its complete depletion is called the desiccation\ntime. Estimating the desiccation time is important for examining the formation\nand evolution of small solar system bodies. Here, we propose a new theoretical\nmodel for evaluating the desiccation time as a function of orbital elements,\nconsidering the contraction of the entire cometary nucleus due to ice\nsublimation. First, we performed numerical calculations of the thermal\nevolution of a cometary nucleus in an eccentric orbit, considering the seasonal\nvariation in the solar heating rate. Next, we derived the desiccation time\nanalytically as a function of orbital elements based on a steady-state model\nconsidering the solar heating rate averaged over the seasons. We compared the\nnumerical solutions for the desiccation time with the analytical solutions and\nclarified the conditions under which the analytical model can be applied.\nAdditionally, based on the analytical model, we derived formulae for estimating\nthe emission rates of water vapor and dust on the surface of the cometary\nnucleus, the maximum size of the emitted dust, and the dust emission velocity,\nby assuming the amount of ice remaining inside the nucleus. Using these\nanalytical solutions, we considered the internal structure and evolution\nprocess of typical CAT objects. Our analytical model was generally consistent\nwith that of the results of earlier observations of these objects. Our model\nprovides a theoretical guideline for discussing the evolution of cometary\nnuclei and the possibility of retaining internal ice in asteroids.\n",
    "author": [
      {
        "name": "Hitoshi Miura"
      },
      {
        "name": "Takumi Yasuda"
      }
    ],
    "arxiv:doi": {
      "_": "10.1093/pasj/psaf048",
      "$": {
        "xmlns:arxiv": "http://arxiv.org/schemas/atom"
      }
    },
    "link": [
      {
        "$": {
          "title": "doi",
          "href": "http://dx.doi.org/10.1093/pasj/psaf048",
          "rel": "related"
        }
      },
      {
        "$": {
          "href": "http://arxiv.org/abs/2505.00423v1",
          "rel": "alternate",
          "type": "text/html"
        }
      },
      {
        "$": {
          "title": "pdf",
          "href": "http://arxiv.org/pdf/2505.00423v1",
          "rel": "related",
          "type": "application/pdf"
        }
      }
    ],
    "arxiv:comment": {
      "_": "This is the original submitted version of the manuscript accepted for\n  publication in Publications of the Astronomical Society of Japan (PASJ). 17\n  pages, 11 figures, 5 tables",
      "$": {
        "xmlns:arxiv": "http://arxiv.org/schemas/atom"
      }
    },
    "arxiv:primary_category": {
      "$": {
        "xmlns:arxiv": "http://arxiv.org/schemas/atom",
        "term": "astro-ph.EP",
        "scheme": "http://arxiv.org/schemas/atom"
      }
    },
    "category": {
      "$": {
        "term": "astro-ph.EP",
        "scheme": "http://arxiv.org/schemas/atom"
      }
    }
  },
  {
    "id": "http://arxiv.org/abs/2505.00407v1",
    "updated": "2025-05-01T08:57:34Z",
    "published": "2025-05-01T08:57:34Z",
    "title": "Multiple generation star formation in Cepheus Flare",
    "summary": "  We present an analysis of the young stellar moving group ASCC 127 using Gaia\nDR3 data, significantly expanding its membership to 3,971 stars -- double the\nnumber identified in previous studies. Using kinematic and distance criteria,\nASCC 127 is divided into five subgroups (Groups 1-5) with ages spanning from 15\nto 32 Myr. Groups 1-5 are spatially linked to the Cepheus Flare star-forming\nregion, revealing potential evidence of four sequential star formation episodes\nat approximately 32 Myr, 20 Myr, 15 Myr, and 7 Myr. Through dust and gas\nmapping, we identify a spatial cavity extending several tens of parsecs, which\nmay have resulted from feedback processes such as supernovae associated with\nearlier generations of stars in the region. This structure, along with the\nlarger Loop III feature, indicates that feedback from massive stars likely\ninfluenced the interstellar medium (ISM). By integrating young stellar\npopulations with ISM studies, we provide a detailed picture of the\nfeedback-driven star formation history in the Cepheus Flare region.\n",
    "author": [
      {
        "name": "Fan Wang"
      },
      {
        "name": "Min Fang"
      },
      {
        "name": "Xiaoting Fu"
      },
      {
        "name": "Yang Su"
      },
      {
        "name": "Xuepeng Chen"
      },
      {
        "name": "Shiyu Zhang"
      },
      {
        "name": "Penghui Liu"
      },
      {
        "name": "Xiao-Long Wang"
      },
      {
        "name": "Haijun Tian"
      },
      {
        "name": "Wenyuan Cui"
      },
      {
        "name": "Zhongmu Li"
      }
    ],
    "arxiv:comment": {
      "_": "Accepted for publication in AJ",
      "$": {
        "xmlns:arxiv": "http://arxiv.org/schemas/atom"
      }
    },
    "link": [
      {
        "$": {
          "href": "http://arxiv.org/abs/2505.00407v1",
          "rel": "alternate",
          "type": "text/html"
        }
      },
      {
        "$": {
          "title": "pdf",
          "href": "http://arxiv.org/pdf/2505.00407v1",
          "rel": "related",
          "type": "application/pdf"
        }
      }
    ],
    "arxiv:primary_category": {
      "$": {
        "xmlns:arxiv": "http://arxiv.org/schemas/atom",
        "term": "astro-ph.SR",
        "scheme": "http://arxiv.org/schemas/atom"
      }
    },
    "category": [
      {
        "$": {
          "term": "astro-ph.SR",
          "scheme": "http://arxiv.org/schemas/atom"
        }
      },
      {
        "$": {
          "term": "astro-ph.GA",
          "scheme": "http://arxiv.org/schemas/atom"
        }
      }
    ]
  },
  {
    "id": "http://arxiv.org/abs/2505.00390v1",
    "updated": "2025-05-01T08:28:06Z",
    "published": "2025-05-01T08:28:06Z",
    "title": "Neutron Star Radii from Laboratory Experiments",
    "summary": "  Our present knowledge of the nuclear equation of state is briefly reviewed in\nthis article intended for a wider readership. Particular emphasis is given to\nthe asymmetric-matter equation of state required for modeling neutron stars,\nneutron-star mergers, and r-process nucleosynthesis. Recent analyses based on\ncombining information obtained from nuclear theory, heavy-ion collisions and\nastrophysical observations confine the obtained radii of the canonical\n1.4-solar-mass neutron star to values between 12 km and 13 km. The remaining\nuncertainty is primarily related to missing information in the density interval\nbetween nuclear saturation density and about twice that value which, however,\nis accessible with laboratory experiments.\n",
    "author": [
      {
        "name": "M. D. Cozma"
      },
      {
        "name": "W. Trautmann"
      }
    ],
    "arxiv:comment": {
      "_": "28 pages, 12 figures, invited review to appear in Int. J. Mod. Phys.\n  E",
      "$": {
        "xmlns:arxiv": "http://arxiv.org/schemas/atom"
      }
    },
    "link": [
      {
        "$": {
          "href": "http://arxiv.org/abs/2505.00390v1",
          "rel": "alternate",
          "type": "text/html"
        }
      },
      {
        "$": {
          "title": "pdf",
          "href": "http://arxiv.org/pdf/2505.00390v1",
          "rel": "related",
          "type": "application/pdf"
        }
      }
    ],
    "arxiv:primary_category": {
      "$": {
        "xmlns:arxiv": "http://arxiv.org/schemas/atom",
        "term": "nucl-th",
        "scheme": "http://arxiv.org/schemas/atom"
      }
    },
    "category": [
      {
        "$": {
          "term": "nucl-th",
          "scheme": "http://arxiv.org/schemas/atom"
        }
      },
      {
        "$": {
          "term": "astro-ph.SR",
          "scheme": "http://arxiv.org/schemas/atom"
        }
      },
      {
        "$": {
          "term": "nucl-ex",
          "scheme": "http://arxiv.org/schemas/atom"
        }
      }
    ]
  },
  {
    "id": "http://arxiv.org/abs/2505.00373v1",
    "updated": "2025-05-01T07:56:08Z",
    "published": "2025-05-01T07:56:08Z",
    "title": "Constraints on the state of the IGM at $z\\sim 8-10$ using redshifted\n  21-cm observations with LOFAR",
    "summary": "  The power spectra of the redshifted 21-cm signal from the Epoch of\nReionization (EoR) contain information about the ionization and thermal states\nof the intergalactic medium (IGM), and depend on the properties of the EoR\nsources. Recently, Mertens et al 2025 has analysed 10 nights of LOFAR high-band\ndata and estimated upper limits on the 21-cm power spectrum at redshifts 8.3,\n9.1 and 10.1. Here we use these upper limit results to constrain the properties\nof the IGM at those redshifts. We focus on the properties of the ionized and\nheated regions where the temperature is larger than that of the CMB. We model\nthe 21-cm power spectrum with the code GRIZZLY, and use a Bayesian inference\nframework to explore the source parameters for uniform priors on their ranges.\nThe framework also provides information about the IGM properties in the form of\nderived parameters. In a model which includes a radio background in excess of\nthe CMB, the 95 (68) per cent credible intervals of disfavoured models at\nredshift 9.1 for the chosen priors correspond to IGM states with averaged\nionization and heated fraction below 0.46 ($\\lesssim 0.05$), an average gas\ntemperature below 44 K (4 K), and a characteristic size of the heated region\n$\\lesssim 14 ~h^{-1} ~\\mathrm{Mpc}$ ($\\lesssim 3 ~h^{-1} ~\\mathrm{Mpc}$). The\n68 per cent credible interval suggests an excess radio background which is more\nthan 100 per cent of the CMB at 1.42 GHz, while the 95 per cent credible\ninterval of the radio background efficiency parameter spans the entire prior\nrange. The behaviour of the credible intervals is similar at all redshifts. The\nmodels disfavoured by the LOFAR upper limits are extreme ones, as they are\nmainly driven by rare and large ionized or heated regions.\n",
    "author": [
      {
        "name": "R. Ghara"
      },
      {
        "name": "S. Zaroubi"
      },
      {
        "name": "B. Ciardi"
      },
      {
        "name": "G. Mellema"
      },
      {
        "name": "S. K. Giri"
      },
      {
        "name": "F. G. Mertens"
      },
      {
        "name": "M. Mevius"
      },
      {
        "name": "L. V. E. Koopmans"
      },
      {
        "name": "I. T. Iliev"
      },
      {
        "name": "A. Acharya"
      },
      {
        "name": "S. A. Brackenhoff"
      },
      {
        "name": "E. Ceccotti"
      },
      {
        "name": "K. Chege"
      },
      {
        "name": "I. Georgiev"
      },
      {
        "name": "S. Ghosh"
      },
      {
        "name": "I. Hothi"
      },
      {
        "name": "C. Höfer"
      },
      {
        "name": "Q. Ma"
      },
      {
        "name": "S. Munshi"
      },
      {
        "name": "A. R. Offringa"
      },
      {
        "name": "A. K. Shaw"
      },
      {
        "name": "V. N. Pandey"
      },
      {
        "name": "S. Yatawatta"
      },
      {
        "name": "M. Choudhury"
      }
    ],
    "arxiv:comment": {
      "_": "23 pages, 20 figures; accepted for publication in Astronomy and\n  Astrophysics (A&A)",
      "$": {
        "xmlns:arxiv": "http://arxiv.org/schemas/atom"
      }
    },
    "link": [
      {
        "$": {
          "href": "http://arxiv.org/abs/2505.00373v1",
          "rel": "alternate",
          "type": "text/html"
        }
      },
      {
        "$": {
          "title": "pdf",
          "href": "http://arxiv.org/pdf/2505.00373v1",
          "rel": "related",
          "type": "application/pdf"
        }
      }
    ],
    "arxiv:primary_category": {
      "$": {
        "xmlns:arxiv": "http://arxiv.org/schemas/atom",
        "term": "astro-ph.CO",
        "scheme": "http://arxiv.org/schemas/atom"
      }
    },
    "category": {
      "$": {
        "term": "astro-ph.CO",
        "scheme": "http://arxiv.org/schemas/atom"
      }
    }
  },
  {
    "id": "http://arxiv.org/abs/2505.00363v1",
    "updated": "2025-05-01T07:22:15Z",
    "published": "2025-05-01T07:22:15Z",
    "title": "Dust density enhancements and the direct formation of planetary cores in\n  gravitationally unstable discs",
    "summary": "  Planet formation via core accretion involves the growth of solids that can\naccumulate to form planetary cores. There are a number of barriers to the\ncollisional growth of solids in protostellar discs, one of which is the drift,\nor metre, barrier. Solid particles experience a drag force that will tend to\ncause them to drift towards the central star in smooth, laminar discs,\npotentially removing particles before they grow large enough to decouple from\nthe disc gas. Here we present 3-dimensional, shearing box simulations that\nexplore the dynamical evolution of solids in a protostellar disc that is\nmassive enough for the gravitational instability to manifest as spiral density\nwaves. We expand on earlier work by considering a range of particle sizes and\nfind that the spirals can still enhance the local solid density by more than an\norder of magnitude, potentially aiding grain growth. Furthermore, if solid\nparticles have enough mass, and the particle size distribution extends to\nsufficiently large particle sizes, the solid component of the disc can undergo\ndirect gravitational collapse to form bound clumps with masses typically\nbetween $1$ and $10$ M$_\\oplus$. Thus, the concentration of dust in a\nself-gravitating disc could bypass the size barrier for collisional growth and\ndirectly form planetary cores early in the lifetime of the disc.\n",
    "author": [
      {
        "name": "Ken Rice"
      },
      {
        "name": "Hans Baehr"
      },
      {
        "name": "Alison K Young"
      },
      {
        "name": "Richard Booth"
      },
      {
        "name": "Sahl Rowther"
      },
      {
        "name": "Farzana Meru"
      },
      {
        "name": "Cassandra Hall"
      },
      {
        "name": "Adam Koval"
      }
    ],
    "arxiv:comment": {
      "_": "15 pages, 11 figures, accepted for publication in Monthly Notices of\n  the Royal Astronomical Society",
      "$": {
        "xmlns:arxiv": "http://arxiv.org/schemas/atom"
      }
    },
    "link": [
      {
        "$": {
          "href": "http://arxiv.org/abs/2505.00363v1",
          "rel": "alternate",
          "type": "text/html"
        }
      },
      {
        "$": {
          "title": "pdf",
          "href": "http://arxiv.org/pdf/2505.00363v1",
          "rel": "related",
          "type": "application/pdf"
        }
      }
    ],
    "arxiv:primary_category": {
      "$": {
        "xmlns:arxiv": "http://arxiv.org/schemas/atom",
        "term": "astro-ph.EP",
        "scheme": "http://arxiv.org/schemas/atom"
      }
    },
    "category": {
      "$": {
        "term": "astro-ph.EP",
        "scheme": "http://arxiv.org/schemas/atom"
      }
    }
  },
  {
    "id": "http://arxiv.org/abs/2505.00355v1",
    "updated": "2025-05-01T07:00:19Z",
    "published": "2025-05-01T07:00:19Z",
    "title": "Attitude Control of Spacecraft for Autonomous Attenuation of Unknown\n  Periodic Disturbance Torque",
    "summary": "  Recently, deep space exploration, especially focusing on halo orbits, the\nperiodic orbits of the Moon, has been widely studied. The spacecraft in halo\norbits performs periodic orbital motion, which affects the attitude motion by\nperiodic disturbances. The conventional attitude control method, PD control, is\nwidely used, but its application to periodic disturbance attenuation is\ninefficient. To address these challenges, this study proposes a predictive\nRepetitive Control (RC) approach that addresses periodic disturbances,\nparticularly GG torque, by exploiting the periodic nature of the system\ndynamics. The proposed method is also applied to the case of using a Reaction\nWheel (RW) as an attitude control actuator. Despite the inherent challenges\nposed by RW limitations, including saturation torque and transmission delay,\nour predictive RC approach effectively mitigates these effects. Numerical\nsimulations demonstrate the robust performance of the proposed method in\nmaintaining attitude control for spacecraft traversing halo orbits near the\nEarth-Moon $L_2$ point, validating its potential for future deep space\nexploration missions.\n",
    "author": [
      {
        "name": "Yuta Hayashi"
      },
      {
        "name": "Mai Bando"
      },
      {
        "name": "Shinji Hokamoto"
      }
    ],
    "arxiv:comment": {
      "_": "22 pages, 16 figures, 7 tables",
      "$": {
        "xmlns:arxiv": "http://arxiv.org/schemas/atom"
      }
    },
    "link": [
      {
        "$": {
          "href": "http://arxiv.org/abs/2505.00355v1",
          "rel": "alternate",
          "type": "text/html"
        }
      },
      {
        "$": {
          "title": "pdf",
          "href": "http://arxiv.org/pdf/2505.00355v1",
          "rel": "related",
          "type": "application/pdf"
        }
      }
    ],
    "arxiv:primary_category": {
      "$": {
        "xmlns:arxiv": "http://arxiv.org/schemas/atom",
        "term": "astro-ph.EP",
        "scheme": "http://arxiv.org/schemas/atom"
      }
    },
    "category": [
      {
        "$": {
          "term": "astro-ph.EP",
          "scheme": "http://arxiv.org/schemas/atom"
        }
      },
      {
        "$": {
          "term": "astro-ph.IM",
          "scheme": "http://arxiv.org/schemas/atom"
        }
      }
    ]
  },
  {
    "id": "http://arxiv.org/abs/2505.00345v1",
    "updated": "2025-05-01T06:45:50Z",
    "published": "2025-05-01T06:45:50Z",
    "title": "Denoising weak lensing mass maps with diffusion model: systematic\n  comparison with generative adversarial network",
    "summary": "  (abridged) Weak gravitational lensing (WL) is the unique and powerful probe\ninto the large-scale structures of the Universe. Removing the shape noise from\nthe observed WL field, i.e., denoising, enhances the potential of WL by\naccessing information at small scales where the shape noise dominates without\ndenoising. We utilise two machine learning (ML) models for denosing: generative\nadversarial network (GAN) and diffusion model (DM). We evaluate the performance\nof denosing with GAN and DM utilising the large suite of mock WL observations,\nwhich serve as the training and test data sets. We apply denoising to 1,000\nmaps with GAN and DM models trained with 39,000 mock observations. Both models\ncan fairly well reproduce the true convergence map on large scales. Then, we\nmeasure cosmological statistics: power spectrum, bispectrum, one-point\nprobability distribution function, peak and minima counts, and scattering\ntransform coefficients. We find that DM outperforms GAN in almost all\nstatistics and recovers the correct statistics down to small scales within\nroughly $0.3 \\sigma$ level at the scales accessible from current and future WL\nsurveys. We also conduct the stress tests on the trained model; denoising the\nmaps with different characteristics, e.g., different source redshifts, from the\ndata used in training. The performance degrades at small scales, but the\nstatistics can still be recovered at large scales. Though the training of DM is\nmore computationally demanding compared with GAN, there are several advantages:\nnumerically stable training, higher performance in the reconstruction of\ncosmological statistics, and sampling multiple realisations once the model is\ntrained. It has been known that DM can generate higher-quality images in\nreal-world problems than GAN, the superiority has been confirmed as well in the\nWL denoising problem.\n",
    "author": [
      {
        "name": "Shohei D. Aoyama"
      },
      {
        "name": "Ken Osato"
      },
      {
        "name": "Masato Shirasaki"
      }
    ],
    "arxiv:comment": {
      "_": "Submitted to A&A, 16 pages, 15+2 figures",
      "$": {
        "xmlns:arxiv": "http://arxiv.org/schemas/atom"
      }
    },
    "link": [
      {
        "$": {
          "href": "http://arxiv.org/abs/2505.00345v1",
          "rel": "alternate",
          "type": "text/html"
        }
      },
      {
        "$": {
          "title": "pdf",
          "href": "http://arxiv.org/pdf/2505.00345v1",
          "rel": "related",
          "type": "application/pdf"
        }
      }
    ],
    "arxiv:primary_category": {
      "$": {
        "xmlns:arxiv": "http://arxiv.org/schemas/atom",
        "term": "astro-ph.CO",
        "scheme": "http://arxiv.org/schemas/atom"
      }
    },
    "category": {
      "$": {
        "term": "astro-ph.CO",
        "scheme": "http://arxiv.org/schemas/atom"
      }
    }
  },
  {
    "id": "http://arxiv.org/abs/2505.00329v1",
    "updated": "2025-05-01T05:58:33Z",
    "published": "2025-05-01T05:58:33Z",
    "title": "Some Questions and Challenges in Measurements of Solar Magnetic Fields",
    "summary": "  Huairou Solar Observing Station of the National Astronomical Observatories of\nthe Chinese Academy of Sciences has been in operation since 1987. Successful\nobservations of the solar vector magnetic field have been conducted during its\noperation. Based on the achievements at Huairou, we analyze the methods of\nobserving the solar magnetic field, including discussions of the approximation\nof the transfer theory of the solar magnetic field in the atmosphere, wide\nfield of view polarized observation, and some questions on the inversion of\nsolar magnetic field data. We also present relevant challenges for further\nresearch.\n",
    "author": [
      {
        "name": "Hongqi Zhang"
      },
      {
        "name": "Jiangtao Su"
      },
      {
        "name": "Xiaofan Wang"
      },
      {
        "name": "Xingming Bao"
      },
      {
        "name": "Yu Liu"
      },
      {
        "name": "Yingzi Sun"
      },
      {
        "name": "Mingyu Zhao"
      }
    ],
    "link": [
      {
        "$": {
          "href": "http://arxiv.org/abs/2505.00329v1",
          "rel": "alternate",
          "type": "text/html"
        }
      },
      {
        "$": {
          "title": "pdf",
          "href": "http://arxiv.org/pdf/2505.00329v1",
          "rel": "related",
          "type": "application/pdf"
        }
      }
    ],
    "arxiv:primary_category": {
      "$": {
        "xmlns:arxiv": "http://arxiv.org/schemas/atom",
        "term": "astro-ph.SR",
        "scheme": "http://arxiv.org/schemas/atom"
      }
    },
    "category": {
      "$": {
        "term": "astro-ph.SR",
        "scheme": "http://arxiv.org/schemas/atom"
      }
    }
  }
]